[Killed] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.jsx:37:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="MenuItemReviewForm-id"
-                id="id"
-                type="number"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {initialContents || <Col>
+            <Form.Group className="mb-3">
+              <Form.Label htmlFor="id">Id</Form.Label>
+              <Form.Control data-testid="MenuItemReviewForm-id" id="id" type="number" {...register("id")} value={initialContents.id} disabled />
+            </Form.Group>
+          </Col>}
         <Col>
           <Form.Group className="mb-3">
killedBy: MenuItemReviewCreatePage tests renders without crashing
statusReason: Cannot read properties of undefined (reading 'id')

[Killed] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.jsx:37:10
   return (
     <Form onSubmit={handleSubmit(submitAction)}>
       <Row>
-        {initialContents && (
-          <Col>
-            <Form.Group className="mb-3">
-              <Form.Label htmlFor="id">Id</Form.Label>
-              <Form.Control
-                data-testid="MenuItemReviewForm-id"
-                id="id"
-                type="number"
-                {...register("id")}
-                value={initialContents.id}
-                disabled
-              />
-            </Form.Group>
-          </Col>
-        )}
+        {true}
         <Col>
           <Form.Group className="mb-3">
killedBy: MenuItemReviewForm tests renders correctly when passing in initialContents
statusReason: Unable to find an element by: [data-testid="MenuItemReviewForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:96:43
               isInvalid={Boolean(errors.stars)}
               {...register("stars", {
                 required: "stars is required.",
-                min: { value: 0, message: "Minimum Rating is 0" },
+                min: { value: 0, message: "" },
                 max: { value: 5, message: "Maximum Rating is 5" },
               })}
killedBy: MenuItemReviewForm tests stars boundary
statusReason: Unable to find an element with the text: /Minimum Rating is 0/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/MenuItemReview/MenuItemReviewForm.jsx:97:22
               {...register("stars", {
                 required: "stars is required.",
                 min: { value: 0, message: "Minimum Rating is 0" },
-                max: { value: 5, message: "Maximum Rating is 5" },
+                max: {},
               })}
             />
killedBy: MenuItemReviewForm tests stars boundary
statusReason: Unable to find an element with the text: /Maximum Rating is 5/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
