[Killed] ArrowFunction
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (MenuItemReview) => ({
-    url: "/api/menuitemreview/post",
-    method: "POST",
-    params: {
-      itemId: MenuItemReview.itemId,
-      reviewerEmail: MenuItemReview.reviewerEmail,
-      stars: MenuItemReview.stars,
-      dateReviewed: MenuItemReview.dateReviewed,
-      comments: MenuItemReview.comments,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (MenuItemReview) => {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /MenuItemReviews
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] StringLiteral
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:9:10
 
 export default function MenuItemReviewCreatePage({ storybook = false }) {
   const objectToAxiosParams = (MenuItemReview) => ({
-    url: "/api/menuitemreview/post",
+    url: "",
     method: "POST",
     params: {
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /MenuItemReviews
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "New MenuItemReview Created - id: 1 itemId: 17",

[Killed] BlockStatement
main/pages/MenuItemReview/MenuItemReviewCreatePage.jsx:20:41
     },
   });
 
-  const onSuccess = (MenuItemReview) => {
-    toast(
-      `New MenuItemReview Created - id: ${MenuItemReview.id} itemId: ${MenuItemReview.itemId}`,
-    );
-  };
+  const onSuccess = (MenuItemReview) => {};
 
   const mutation = useBackendMutation(
killedBy: MenuItemReviewCreatePage tests on submit, makes request to backend, and redirects to /MenuItemReviews
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
