[Killed] StringLiteral
main/components/Articles/ArticlesTable.jsx:15:18
 export default function ArticlesTable({
   articles,
   currentUser,
-  testIdPrefix = "ArticlesTable",
+  testIdPrefix = "",
 }) {
   const navigate = useNavigate();
killedBy: ArticlesTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="ArticlesTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid=""

[Killed] StringLiteral
main/components/Articles/ArticlesTable.jsx:43:15
       accessorKey: "id",
     },
     {
-      header: "Title",
+      header: "",
       accessorKey: "title",
     },
killedBy: ArticlesTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Title. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="ArticlesTable"
