[Killed] BooleanLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:36:22
               message: "Max length 3 characters",
             },
           })}
-          disabled={!!initialContents}
+          disabled={!initialContents}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests renders correctly with no initialContents
statusReason: expect(element).not.toBeDisabled()

Received element is disabled:
  <input
  class="form-control"
  data-testid="UCSBOrganizationForm-orgCode"
  disabled=""
  id="orgCode"

[Killed] ObjectLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:86:36
           id="inactive"
           type="boolean"
           isInvalid={Boolean(errors.inactive)}
-          {...register("inactive", {
-            required: "inactive is required.",
-          })}
+          {...register("inactive", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /inactive is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/UCSBOrganization/UCSBOrganizationForm.jsx:87:23
           type="boolean"
           isInvalid={Boolean(errors.inactive)}
           {...register("inactive", {
-            required: "inactive is required.",
+            required: "",
           })}
         />
killedBy: UCSBOrganizationForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /inactive is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
