[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationCreatePage.jsx:7:54
 import { _useBackendMutation } from "main/utils/useBackend";
 import { _toast } from "react-toastify";
 
-export default function UCSBOrganizationCreatePage() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Create Page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function UCSBOrganizationCreatePage() {}
 
killedBy: UCSBOrganizationCreatePage tests renders without crashing
statusReason: Unable to find an element with the text: Create Page not yet implemented. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
