[Killed] BlockStatement
main/pages/UCSBOrganization/UCSBOrganizationEditPage.jsx:8:52
 import { _useBackend, _useBackendMutation } from "main/utils/useBackend";
 import { _toast } from "react-toastify";
 
-export default function UCSBOrganizationEditPage() {
-  return (
-    <BasicLayout>
-      <div className="pt-2">
-        <h1>Edit Page not yet implemented</h1>
-      </div>
-    </BasicLayout>
-  );
-}
+export default function UCSBOrganizationEditPage() {}
 
killedBy: RestaurantEditPage tests renders without crashing
statusReason: Unable to find an element with the text: Edit Page not yet implemented. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
