[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestIndexPage.jsx:12:30
 export default function RecommendationRequestIndexPage() {
   const currentUser = useCurrentUser();
 
-  const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/RecommendationRequest/create"
-          style={{ float: "right" }}
-        >
-          Create Recommendation Request
-        </Button>
-      );
-    }
-  };
+  const createButton = () => {};
 
   const {
killedBy: RecommendationRequestIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create Recommendation Request/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/RecommendationRequest/RecommendationRequestIndexPage.jsx:13:45
   const currentUser = useCurrentUser();
 
   const createButton = () => {
-    if (hasRole(currentUser, "ROLE_ADMIN")) {
-      return (
-        <Button
-          variant="primary"
-          href="/RecommendationRequest/create"
-          style={{ float: "right" }}
-        >
-          Create Recommendation Request
-        </Button>
-      );
-    }
+    if (hasRole(currentUser, "ROLE_ADMIN")) {}
   };
 
killedBy: RecommendationRequestIndexPage tests Renders with Create Button for admin user
statusReason: Unable to find an element with the text: /Create Recommendation Request/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] StringLiteral
main/pages/RecommendationRequest/RecommendationRequestIndexPage.jsx:18:27
         <Button
           variant="primary"
           href="/RecommendationRequest/create"
-          style={{ float: "right" }}
+          style={{ float: "" }}
         >
           Create Recommendation Request
killedBy: RecommendationRequestIndexPage tests Renders with Create Button for admin user
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null

[Killed] ObjectLiteral
main/pages/RecommendationRequest/RecommendationRequestIndexPage.jsx:18:18
         <Button
           variant="primary"
           href="/RecommendationRequest/create"
-          style={{ float: "right" }}
+          style={{}}
         >
           Create Recommendation Request
killedBy: RecommendationRequestIndexPage tests Renders with Create Button for admin user
statusReason: expect(element).toHaveAttribute("style", "float: right;") // element.getAttribute("style") === "float: right;"

Expected the element to have attribute:
  style="float: right;"
Received:
  null
