[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:57:29
                 type="text"
                 isInvalid={Boolean(errors.requesterEmail)}
                 {...register("requesterEmail", {
-                  required: "requesterEmail is required.",
+                  required: "",
                   pattern: email_regex,
                 })}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /requesterEmail is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] LogicalOperator
main/components/RecommendationRequest/RecommendationRequestForm.jsx:63:18
               />
               <Form.Control.Feedback type="invalid">
                 {errors.requesterEmail?.message}
-                {errors.requesterEmail?.type === "pattern" &&
-                  "Requester Email must be an email."}
+                {errors.requesterEmail?.type === "pattern" || "Requester Email must be an email."}
               </Form.Control.Feedback>
             </Form.Group>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Found multiple elements with the text: /Requester Email/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="requesterEmail"

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:85:18
               />
               <Form.Control.Feedback type="invalid">
                 {errors.professorEmail?.message}
-                {errors.professorEmail?.type === "pattern" &&
-                  "Professor Email must be an email."}
+                {true}
               </Form.Control.Feedback>
             </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Professor Email must be an email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ConditionalExpression
main/components/RecommendationRequest/RecommendationRequestForm.jsx:85:18
               />
               <Form.Control.Feedback type="invalid">
                 {errors.professorEmail?.message}
-                {errors.professorEmail?.type === "pattern" &&
+                {true &&
                   "Professor Email must be an email."}
               </Form.Control.Feedback>
killedBy: RecommendationRequestForm tests renders correctly
statusReason: Found multiple elements with the text: /Professor Email/

Here are the matching elements:

Ignored nodes: comments, script, style
<label
  class="form-label"
  for="professorEmail"

[Killed] StringLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:86:19
               <Form.Control.Feedback type="invalid">
                 {errors.professorEmail?.message}
                 {errors.professorEmail?.type === "pattern" &&
-                  "Professor Email must be an email."}
+                  ""}
               </Form.Control.Feedback>
             </Form.Group>
killedBy: RecommendationRequestForm tests Correct Error messsages on bad input
statusReason: Unable to find an element with the text: /Professor Email must be an email./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:101:45
               id="dateRequested"
               type="datetime-local"
               isInvalid={Boolean(errors.dateRequested)}
-              {...register("dateRequested", {
-                required: true, // Could be false, if we just take the current datetime
-                pattern: isodate_regex,
-              })}
+              {...register("dateRequested", {})}
             />
             <Form.Control.Feedback type="invalid">
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Date Requested is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:102:27
               type="datetime-local"
               isInvalid={Boolean(errors.dateRequested)}
               {...register("dateRequested", {
-                required: true, // Could be false, if we just take the current datetime
+                required: false, // Could be false, if we just take the current datetime
                 pattern: isodate_regex,
               })}
killedBy: RecommendationRequestForm tests Correct Error messsages on missing input
statusReason: Unable to find an element with the text: /Date Requested is required./. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
