[Killed] BlockStatement
main/components/RecommendationRequest/RecommendationRequestTable.jsx:15:34
 export default function RecommendationRequestTable({ recReqs, currentUser }) {
   const navigate = useNavigate();
 
-  const editCallback = (cell) => {
-    navigate(`/RecommendationRequest/edit/${cell.row.original.id}`);
-  };
+  const editCallback = (cell) => {};
 
   // Stryker disable all : hard to test for query caching
killedBy: UserTable tests Edit button navigates to the edit page for admin user
statusReason: expected "vi.fn()" to be called with arguments: [ '/RecommendationRequest/edit/1' ]

Number of calls: 0


Ignored nodes: comments, script, style
<html>
  <head />
