[Survived] ObjectLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:161:36
               id="done"
               type="boolean"
               isInvalid={Boolean(errors.done)}
-              {...register("done", {
-                required: "Done is required.",
-                defaultValues: false,
-              })}
+              {...register("done", {})}
             />
             <Form.Control.Feedback type="invalid">

[Survived] BooleanLiteral
main/components/RecommendationRequest/RecommendationRequestForm.jsx:163:32
               isInvalid={Boolean(errors.done)}
               {...register("done", {
                 required: "Done is required.",
-                defaultValues: false,
+                defaultValues: true,
               })}
             />
