[Killed] BooleanLiteral
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsCreatePage.jsx:8:15
 import { toast } from "react-toastify";
 
 export default function UCSBDiningCommonsMenuItemsCreatePage({
-  storybook = false,
+  storybook = true,
 }) {
   const objectToAxiosParams = (ucsbDiningCommonsMenuItem) => ({
killedBy: UCSBDiningCommonsMenuItemsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0

[Killed] BlockStatement
main/pages/UCSBDiningCommonsMenuItems/UCSBDiningCommonsMenuItemsCreatePage.jsx:39:32
     mutation.mutate(data);
   };
 
-  if (isSuccess && !storybook) {
-    return <Navigate to="/ucsbdiningcommonsmenuitems" />;
-  }
+  if (isSuccess && !storybook) {}
 
   return (
killedBy: UCSBDiningCommonsMenuItemsCreatePage tests when you fill in the form and hit submit, it makes a request to the backend
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
