[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:96:39
           id="requestTime"
           type="datetime-local"
           isInvalid={Boolean(errors.requestTime)}
-          {...register("requestTime", {
-            required: "Request Time in UTC is required.",
-          })}
+          {...register("requestTime", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Request Time in UTC is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:97:23
           type="datetime-local"
           isInvalid={Boolean(errors.requestTime)}
           {...register("requestTime", {
-            required: "Request Time in UTC is required.",
+            required: "",
           })}
         />
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Request Time in UTC is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
