[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:15:18
 export default function HelpRequestTable({
   helpRequests,
   currentUser,
-  testIdPrefix = "HelpRequestTable",
+  testIdPrefix = "",
 }) {
   const navigate = useNavigate();
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid=""

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:20:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/helprequests/edit/${cell.row.original.id}`);
+    navigate(``);
   };
 
killedBy: HelpRequestTable tests Edit button navigates to the edit page
statusReason: expected "vi.fn()" to be called with arguments: [ '/helprequests/edit/1' ]

Received: 

  1st vi.fn() call:

  [
-   "/helprequests/edit/1",

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.jsx:43:5
       accessorKey: "id", // accessor is the "key" in the data
     },
 
-    {
-      header: "Requester Email",
-      accessorKey: "requesterEmail",
-    },
+    {},
 
     {
killedBy: HelpRequestIndexPage tests Renders with Create Button for admin user
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:44:15
     },
 
     {
-      header: "Requester Email",
+      header: "",
       accessorKey: "requesterEmail",
     },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Requester Email. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestTable.jsx:53:5
       accessorKey: "teamId",
     },
 
-    {
-      header: "Table or Breakout room",
-      accessorKey: "tableOrBreakoutRoom",
-    },
+    {},
 
     {
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Columns require an id when using a non-string header

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:55:20
 
     {
       header: "Table or Breakout room",
-      accessorKey: "tableOrBreakoutRoom",
+      accessorKey: "",
     },
 
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-tableOrBreakoutRoom"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestTable.jsx:64:15
     },
 
     {
-      header: "Explanation",
+      header: "",
       accessorKey: "explanation",
     },
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: Unable to find an element with the text: Explanation. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered"
      data-testid="HelpRequestTable"
