[Killed] ArrowFunction
main/pages/HelpRequests/HelpRequestCreatePage.jsx:8:31
 import { toast } from "react-toastify";
 
 export default function HelpRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/helprequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosParams = () => undefined;
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] ObjectLiteral
main/pages/HelpRequests/HelpRequestCreatePage.jsx:8:49
 import { toast } from "react-toastify";
 
 export default function HelpRequestCreatePage({ storybook = false }) {
-  const objectToAxiosParams = (helpRequest) => ({
-    url: "/api/helprequests/post",
-    method: "POST",
-    params: {
-      requesterEmail: helpRequest.requesterEmail,
-      teamId: helpRequest.teamId,
-      tableOrBreakoutRoom: helpRequest.tableOrBreakoutRoom,
-      requestTime: helpRequest.requestTime,
-      explanation: helpRequest.explanation,
-      solved: helpRequest.solved,
-    },
-  });
+  const objectToAxiosParams = (helpRequest) => ({});
 
   const onSuccess = (helpRequest) => {
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: expected +0 to be 1 // Object.is equality

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div>
      <div

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestCreatePage.jsx:21:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(
-      `New help request Created - id: ${helpRequest.id} explanation: ${helpRequest.explanation}`,
-    );
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestCreatePage tests on submit, makes request to backend, and redirects to /helprequests
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Number of calls: 0
