[Killed] ObjectLiteral
main/pages/HelpRequests/HelpRequestEditPage.jsx:18:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/helprequests?id=${id}`],
-    {
-      // Stryker disable next-line all : GET is the default, so mutating this to "" doesn't introduce a bug
-      method: "GET",
-      url: `/api/helprequests`,
-      params: {
-        id,
-      },
-    },
+    {},
   );
 
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] BlockStatement
main/pages/HelpRequests/HelpRequestEditPage.jsx:44:38
     },
   });
 
-  const onSuccess = (helpRequest) => {
-    toast(`Help Request Updated - id: ${helpRequest.id} explanation: ${helpRequest.explanation}`);
-  };
+  const onSuccess = (helpRequest) => {};
 
   const mutation = useBackendMutation(
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called at least once

Ignored nodes: comments, script, style
<html>
  <head />
  <body>
    <div />
  </body>

[Killed] StringLiteral
main/pages/HelpRequests/HelpRequestEditPage.jsx:45:11
   });
 
   const onSuccess = (helpRequest) => {
-    toast(`Help Request Updated - id: ${helpRequest.id} explanation: ${helpRequest.explanation}`);
+    toast(``);
   };
 
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: expected "vi.fn()" to be called with arguments: [ Array(1) ]

Received: 

  1st vi.fn() call:

  [
-   "Help Request Updated - id: 17 explanation: I need a lot of help with the project",

[Killed] ConditionalExpression
main/pages/HelpRequests/HelpRequestEditPage.jsx:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Help Request</h1>
-        {helpRequest && (
-          <HelpRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={helpRequest}
-          />
-        )}
+        {true}
       </div>
     </BasicLayout>
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ConditionalExpression
main/pages/HelpRequests/HelpRequestEditPage.jsx:69:10
     <BasicLayout>
       <div className="pt-2">
         <h1>Edit Help Request</h1>
-        {helpRequest && (
-          <HelpRequestForm
-            submitAction={onSubmit}
-            buttonLabel={"Update"}
-            initialContents={helpRequest}
-          />
-        )}
+        {false}
       </div>
     </BasicLayout>
killedBy: HelpRequestEditPage tests tests where backend is working normally Is populated with the data provided
statusReason: Unable to find an element by: [data-testid="HelpRequestForm-id"]

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
