[Killed] ObjectLiteral
main/components/HelpRequests/HelpRequestForm.jsx:64:34
           id="teamID"
           type="text"
           isInvalid={Boolean(errors.teamID)}
-          {...register("teamID", {
-            required: "Team ID is required.",
-          })}
+          {...register("teamID", {})}
         />
         <Form.Control.Feedback type="invalid">
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Team ID is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >

[Killed] StringLiteral
main/components/HelpRequests/HelpRequestForm.jsx:65:23
           type="text"
           isInvalid={Boolean(errors.teamID)}
           {...register("teamID", {
-            required: "Team ID is required.",
+            required: "",
           })}
         />
killedBy: HelpRequestForm tests that the correct validations are performed
statusReason: Unable to find an element with the text: /Team ID is required/. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <form
      class=""
    >
